Revit 2026 API
EnergyDataSettings.PercentageGlazing Property
 Used for the conceptual energy model. The approximate percentage of the building exterior wall surfaces which are covered by windows or other glazing.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public double PercentageGlazing { get; set; }
Public Property PercentageGlazing As Double
	Get
	Set
public:
property double PercentageGlazing {
	double get ();
	void set (double value);
}
member PercentageGlazing : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The percentage glazing value is not between 0.00 and 0.95.
Remarks
 This value is used to automatically model these glazed openings in massing instances for the Conceptual Energy Analytical Model.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace